res/cf/Catalogs/СпискиИнформационныхБаз.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.18">
	<Catalog>
		<Properties>
			<Name>СпискиИнформационныхБаз</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>РасположениеСписка</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>150</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Пользователь</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Глобальный</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ДопПараметры</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИнформационнаяБаза</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ИнформационныеБазы1С</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПоложениеИБВДеревеСписка</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>75</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВерсияПлатформы</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВерсииПлатформы1С</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Наименование</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>100</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СкоростьКлиентскогоСоединения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.СкоростьКлиентскогоСоединения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ТипКлиентскогоПриложения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.ТипыКлиентскогоПриложения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>РазрядностьКлиентскогоПриложения</Name>
							<Type>
								<v8:Type>cfg:EnumRef.РазрядностьКлиентскогоПриложения</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрЗапуска</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Уровень</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>1</v8:Digits>
									<v8:FractionDigits>0</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ПараметрыЗаполнены</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

res/cf/Catalogs/СпискиИнформационныхБаз/Forms/ДополнительныеПараметры/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	ИнформационнаяБаза = Параметры.ИнформационнаяБаза;
	ПараметрЗапуска = Параметры.ПараметрЗапуска;
	ТипКлиентскогоПриложения = Параметры.ТипКлиентскогоПриложения;
	СкоростьКлиентскогоСоединения = Параметры.СкоростьКлиентскогоСоединения;
	ВерсияПлатформы = Параметры.ВерсияПлатформы;
	РазрядностьКлиентскогоПриложения = Параметры.РазрядностьКлиентскогоПриложения;
	
КонецПроцедуры

#КонецОбласти


#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура ЗакрытьФорму(Команда)
	ЭтаФорма.Закрыть();
КонецПроцедуры

&НаКлиенте
Процедура СохранитьИЗакрыть(Команда)
	
	ДопПараметры = Новый Структура;
	ДопПараметры.Вставить("ИнформационнаяБаза", ИнформационнаяБаза);
	ДопПараметры.Вставить("ВерсияПлатформы", ВерсияПлатформы);
	ДопПараметры.Вставить("РазрядностьКлиентскогоПриложения", РазрядностьКлиентскогоПриложения);
	ДопПараметры.Вставить("ТипКлиентскогоПриложения", ТипКлиентскогоПриложения);
	ДопПараметры.Вставить("СкоростьКлиентскогоСоединения", СкоростьКлиентскогоСоединения);
	ДопПараметры.Вставить("ПараметрЗапуска", ПараметрЗапуска);
	
	ЭтаФорма.Закрыть(ДопПараметры);
	
КонецПроцедуры

#КонецОбласти
